* Refiling Tasks 						       :NOTE:
  CLOCK: [2011-09-20 Tue 14:12]--[2011-09-20 Tue 14:14] =>  0:02
  :PROPERTIES:
  :ORDERED:  t
  :END:
4.2 Refiling Tasks

Tasks to refile are in their own section of the block agenda. To find tasks 
to refile I run my agenda view with F12 SPC and scroll down to second section 
of the block agenda: Tasks to Refile. This view shows all tasks (even ones marked 
in a done state). Alternatively I just use F12 r on my slower Eee PC.

Bulk refiling in the agenda works very well for multiple tasks going to the same 
place. Just mark the tasks with m and then B r to refile all of them to a new location. 
Occasionally I'll also refile tasks as subtasks of the current clocking task 
using C-2 C-c C-w from the refile.org file.

Refiling all of my tasks tends to take less than a minute so I may do this a 
couple of times a day.

4.3 Refiling Notes

I keep a * Notes headline in most of my org-mode files. Notes have a NOTE tag 
which is created by the capture template for notes. This allows finding notes 
across multiple files easily using the agenda search functions.

Notes created by capture tasks go first to refile.org and are later refiled to 
the appropriate project file. Some notes that are project related get filed to 
the appropriate project instead of under the catchall * NOTES task. Generally 
these types of notes are specific to the project and not generally useful – so 
removing them from the notes list when the project is archived makes sense.

4.4 Refiling Phone Calls

Phone calls are handled using capture mode and a few custom functions that look 
up addressbook information in bbdb. I time my calls using the capture mode 
template settings to clock in and out the capture task while the phone call is 
in progress.

Phone call tasks collect in refile.org and are later refiled to the appropriate 
location. Some phone calls are billable and we want these tracked in the 
appropriate category.


[2011-09-20 Tue 01:47]
[[file:~/org/todolist.org::*org-mode%20refile][org-mode refile]]
* SOMEDAY 需要在emacs 里面配置一个w3m.				    :WAITING:
  - State "SOMEDAY"    from "STARTED"    [2011-09-21 Wed 14:03]
[2011-09-20 Tue 09:20]
[[file:~/org/todolist.org::*http://doc.norang.ca/org-mode.html][http://doc.norang.ca/org-mode.html]]
* TODO schedule todo list to somedays.
  CLOCK: [2011-09-20 Tue 10:21]--[2011-09-20 Tue 10:22] =>  0:01
[2011-09-20 Tue 10:21]
* TODO 升级 www.17forex.com 的系统软件。
[2011-09-21 Wed 16:54]
[[file:~/org/refile.org::*%E9%85%8D%E7%BD%AE%E4%B8%80%E4%B8%AAgnus%20mail][配置一个gnus mail]]
* 送餐地址								       :NOTE:
[2011-09-22 Thu 12:54]
[[file:~/.emacs.d/tp/tradeplan.el]]
东三环北路 38 号院 1号楼 15层.
* DONE move openvpn and hgpush to turbo-dt .
  CLOCK: [2011-09-24 Sat 23:50]--[2011-09-26 Mon 16:08] => 40:18
[2011-09-24 Sat 23:50]
* Write an invitation message from snoc-engineering 		       :NOTE:
   CLOCK: [2011-09-25 Sun 09:41]--[2011-09-25 Sun 09:55] =>  0:14
[2011-09-25 Sun 09:41]
[[file:~/org/gemstone.org::*%E7%A1%AE%E5%AE%9A%E6%99%AE%E9%80%9A%E6%9C%BA%E5%99%A8%E4%B8%8A%E9%9C%80%E8%A6%81%E5%AE%89%E8%A3%85%E7%9A%84%20tops%20%E5%8C%85%EF%BC%8C%E6%9D%A5%E8%AF%84%E4%BC%B0%E7%B3%BB%E7%BB%9F%E5%BD%B1%E5%93%8D.][确定普通机器上需要安装的 tops 包，来评估系统影响.]]

* DONE 翻译 reminders 尝试使用 orgmode 做提醒
  :LOGBOOK:
  CLOCK: [2011-09-26 Mon 17:16]--[2011-09-26 Mon 17:27] =>  0:11
  :END:
[2011-09-26 Mon 17:13]
[[file:~/org/docs/orgmode-tut.org::*Reminders][Reminders]]
	翻译完毕，但是具体还不知道怎么用
* TODO 搞清楚 ID 是干啥用的
  :LOGBOOK:
  :END:
[2011-09-26 Mon 17:36]
[[file:~/org/docs/orgmode-tut.org::*Time%20Clocking][Time Clocking]]
* STARTED 翻译 time clocking , 学习作者为什么会沉迷于clocking.
  :LOGBOOK:
  CLOCK: [2011-09-27 Tue 10:26]--[2011-09-27 Tue 10:53] =>  0:27
  CLOCK: [2011-09-26 Mon 17:55]--[2011-09-27 Tue 10:16] => 16:21
  CLOCK: [2011-09-26 Mon 17:39]--[2011-09-26 Mon 17:54] =>  0:15
  :END:
[2011-09-26 Mon 17:38]
[[file:~/org/docs/orgmode-tut.org::*Time%20Clocking][Time Clocking]]
* TODO  王惠军 汇钱
  :LOGBOOK:
  CLOCK: [2011-09-26 Mon 17:54]--[2011-09-26 Mon 17:55] =>  0:01
  :END:
[2011-09-26 Mon 17:54]
[[file:~/org/docs/orgmode-tut.org::*Time%20Clocking][Time Clocking]]
6226 0901 0598 4856
* STARTED smoking 						       :NOTE:
   :LOGBOOK:
   CLOCK: [2011-09-27 Tue 11:01]
   CLOCK: [2011-09-27 Tue 10:17]--[2011-09-27 Tue 10:26] =>  0:09
   :END:
[[file:~/org/docs/orgmode-tut.org::*Key%20bindings][Key bindings]]
* DONE emacs 'bbdb 'bbdb-com 是否可以作为存储交易计划的emacs数据库来使用？ :NOTE:
   :LOGBOOK:
   CLOCK: [2011-09-27 Tue 10:53]--[2011-09-27 Tue 10:57] =>  0:04
   :END:
[2011-09-27 Tue 10:53]
[[file:~/org/docs/orgmode-tut.org::*Handling%20Phone%20Calls][Handling Phone Calls]]
The Insidious Big Brother Database (BBDB) is a contact management utility
不能
